IOsonata/IOsonata/ARM/Microchip/SAM4L/include/sam4lxxx.h
/**-------------------------------------------------------------------------
@file	sam4lxxx.h

@brief	Microchip SAM4L series

@author	Hoang Nguyen Hoan
@date	Aug. 28, 2021

@license

MIT License

Copyright (c) 2021 I-SYST inc. All rights reserved.

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.

----------------------------------------------------------------------------*/
#ifndef __SAM4LXXX_H__
#define __SAM4LXXX_H__

#include "cmsis_compiler.h"

#if !defined(SAM4LCXA) && !defined(SAM4LCXB) && !defined(SAM4LCXC) && !defined(SAM4LSXA) && !defined(SAM4LSXB) && !defined(SAM4LSXC)
	#if defined(__ATSAM4LC2A__) || defined(__SAM4LC2A__) || defined(__ATSAM4LC4A__) || defined(__SAM4LC4A__) || defined(__ATSAM4LC8A__) || defined(__SAM4LC8A__)
		#define SAM4LCXA
	#elif defined(__ATSAM4LC2B__) || defined(__SAM4LC2B__) || defined(__ATSAM4LC4B__) || defined(__SAM4LC4B__) || defined(__ATSAM4LC8B__) || defined(__SAM4LC8B__)
		#define SAM4LCXB
	#elif defined(__ATSAM4LC2C__) || defined(__SAM4LC2C__) || defined(__ATSAM4LC4C__) || defined(__SAM4LC4C__) || defined(__ATSAM4LC8C__) || defined(__SAM4LC8C__)
		#define SAM4LCXC
	#elif defined(__ATSAM4LS2A__) || defined(__SAM4LS2A__) || defined(__ATSAM4LS4A__) || defined(__SAM4LS4A__) || defined(__ATSAM4LS8A__) || defined(__SAM4LS8A__)
		#define SAM4LSXA
	#elif defined(__ATSAM4LS2B__) || defined(__SAM4LS2B__) || defined(__ATSAM4LS4B__) || defined(__SAM4LS4B__) || defined(__ATSAM4LS8B__) || defined(__SAM4LS8B__)
		#define SAM4LSXB
	#elif defined(__ATSAM4LS2C__) || defined(__SAM4LS2C__) || defined(__ATSAM4LS4C__) || defined(__SAM4LS4C__) || defined(__ATSAM4LS8C__) || defined(__SAM4LS8C__)
		#define SAM4LSXC
	#endif
#else
// Set default __SAM4Lx8x__ if none defined
	#ifdef SAM4LCXA
		#if !defined(__ATSAM4LC2A__) && !defined(__SAM4LC2A__) && !defined(__ATSAM4LC4A__) && !defined(__SAM4LC4A__) && !defined(__ATSAM4LC8A__) && !defined(__SAM4LC8A__)
		#define __SAM4LC8A__
		#endif
	#elif defined(SAM4LCXB)
		#if !defined(__ATSAM4LC2B__) && !defined(__SAM4LC2B__) && !defined(__ATSAM4LC4B__) && !defined(__SAM4LC4B__) && !defined(__ATSAM4LC8B__) && !defined(__SAM4LC8B__)
		#define __SAM4LC8B__
		#endif
	#elif defined(SAM4LCXC)
		#if !defined(__ATSAM4LC2C__) && !defined(__SAM4LC2C__) && !defined(__ATSAM4LC4C__) && !defined(__SAM4LC4C__) && !defined(__ATSAM4LC8C__) && !defined(__SAM4LC8C__)
		#define __SAM4LC8C__
		#endif
	#elif defined(SAM4LSXA)
		#if !defined(__ATSAM4LS2A__) && !defined(__SAM4LS2A__) && !defined(__ATSAM4LS4A__) && !defined(__SAM4LS4A__) && !defined(__ATSAM4LS8A__) && !defined(__SAM4LS8A__)
		#define __SAM4LS8A__
		#endif
	#elif defined(SAM4LSXB)
		#if !defined(__ATSAM4LS2B__) && !defined(__SAM4LS2B__) && !defined(__ATSAM4LS4B__) && !defined(__SAM4LS4B__) && !defined(__ATSAM4LS8B__) && !defined(__SAM4LS8B__)
		#define __SAM4LS8B__
		#endif
	#elif defined(SAM4LSXC)
		#if !defined(__ATSAM4LS2C__) && !defined(__SAM4LS2C__) && !defined(__ATSAM4LS4C__) && !defined(__SAM4LS4C__) && !defined(__ATSAM4LS8C__) && !defined(__SAM4LS8C__)
		#define __SAM4LS8C__
		#endif
	#endif
#endif

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#include <stdint.h>
#ifndef __cplusplus
typedef volatile const uint32_t RoReg;   /**< Read only 32-bit register (volatile const unsigned int) */
typedef volatile const uint16_t RoReg16; /**< Read only 16-bit register (volatile const unsigned int) */
typedef volatile const uint8_t  RoReg8;  /**< Read only  8-bit register (volatile const unsigned int) */
#else
typedef volatile       uint32_t RoReg;   /**< Read only 32-bit register (volatile const unsigned int) */
typedef volatile       uint16_t RoReg16; /**< Read only 16-bit register (volatile const unsigned int) */
typedef volatile       uint8_t  RoReg8;  /**< Read only  8-bit register (volatile const unsigned int) */
#endif
typedef volatile       uint32_t WoReg;   /**< Write only 32-bit register (volatile unsigned int) */
typedef volatile       uint16_t WoReg16; /**< Write only 16-bit register (volatile unsigned int) */
typedef volatile       uint8_t  WoReg8;  /**< Write only  8-bit register (volatile unsigned int) */
typedef volatile       uint32_t RwReg;   /**< Read-Write 32-bit register (volatile unsigned int) */
typedef volatile       uint16_t RwReg16; /**< Read-Write 16-bit register (volatile unsigned int) */
typedef volatile       uint8_t  RwReg8;  /**< Read-Write  8-bit register (volatile unsigned int) */
#define CAST(type, value) ((type *)(value))
#define REG_ACCESS(type, address) (*(type*)(address)) /**< C code: Register value */
#else
#define CAST(type, value) (value)
#define REG_ACCESS(type, address) (address) /**< Assembly code: Register address */
#endif

/**< Interrupt Number Definition */
typedef enum IRQn
{
  /******  Cortex-M4 Processor Exceptions Numbers *******************************/
  NonMaskableInt_IRQn      = -14, /**<  2 Non Maskable Interrupt                */
  HardFault_IRQn           = -13, /**<  3 Cortex-M4 Hard Fault Interrupt        */
  MemoryManagement_IRQn    = -12, /**<  4 Cortex-M4 Memory Management Interrupt */
  BusFault_IRQn            = -11, /**<  5 Cortex-M4 Bus Fault Interrupt         */
  UsageFault_IRQn          = -10, /**<  6 Cortex-M4 Usage Fault Interrupt       */
  SVCall_IRQn              = -5,  /**< 11 Cortex-M4 SV Call Interrupt           */
  DebugMonitor_IRQn        = -4,  /**< 12 Cortex-M4 Debug Monitor Interrupt     */
  PendSV_IRQn              = -2,  /**< 14 Cortex-M4 Pend SV Interrupt           */
  SysTick_IRQn             = -1,  /**< 15 Cortex-M4 System Tick Interrupt       */
  /******  SAM4LC2A-specific Interrupt Numbers ***********************/
  HFLASHC_IRQn             =  0, /**<  0 SAM4LC2A Flash Controller (HFLASHC) */
  PDCA_0_IRQn              =  1, /**<  1 SAM4LC2A Peripheral DMA Controller (PDCA) */
  PDCA_1_IRQn              =  2, /**<  2 SAM4LC2A Peripheral DMA Controller (PDCA) */
  PDCA_2_IRQn              =  3, /**<  3 SAM4LC2A Peripheral DMA Controller (PDCA) */
  PDCA_3_IRQn              =  4, /**<  4 SAM4LC2A Peripheral DMA Controller (PDCA) */
  PDCA_4_IRQn              =  5, /**<  5 SAM4LC2A Peripheral DMA Controller (PDCA) */
  PDCA_5_IRQn              =  6, /**<  6 SAM4LC2A Peripheral DMA Controller (PDCA) */
  PDCA_6_IRQn              =  7, /**<  7 SAM4LC2A Peripheral DMA Controller (PDCA) */
  PDCA_7_IRQn              =  8, /**<  8 SAM4LC2A Peripheral DMA Controller (PDCA) */
  PDCA_8_IRQn              =  9, /**<  9 SAM4LC2A Peripheral DMA Controller (PDCA) */
  PDCA_9_IRQn              = 10, /**< 10 SAM4LC2A Peripheral DMA Controller (PDCA) */
  PDCA_10_IRQn             = 11, /**< 11 SAM4LC2A Peripheral DMA Controller (PDCA) */
  PDCA_11_IRQn             = 12, /**< 12 SAM4LC2A Peripheral DMA Controller (PDCA) */
  PDCA_12_IRQn             = 13, /**< 13 SAM4LC2A Peripheral DMA Controller (PDCA) */
  PDCA_13_IRQn             = 14, /**< 14 SAM4LC2A Peripheral DMA Controller (PDCA) */
  PDCA_14_IRQn             = 15, /**< 15 SAM4LC2A Peripheral DMA Controller (PDCA) */
  PDCA_15_IRQn             = 16, /**< 16 SAM4LC2A Peripheral DMA Controller (PDCA) */
  CRCCU_IRQn               = 17, /**< 17 SAM4LC2A CRC Calculation Unit (CRCCU) */
  USBC_IRQn                = 18, /**< 18 SAM4LC2A USB 2.0 Interface (USBC) */
  PEVC_TR_IRQn             = 19, /**< 19 SAM4LC2A Peripheral Event Controller (PEVC) */
  PEVC_OV_IRQn             = 20, /**< 20 SAM4LC2A Peripheral Event Controller (PEVC) */
#if defined(SAM4LCXA) || defined(SAM4LCXB) || defined(SAM4LCXC)
  AESA_IRQn                = 21, /**< 21 SAM4LC2A Advanced Encryption Standard (AESA) */
#endif
  PM_IRQn                  = 22, /**< 22 SAM4LC2A Power Manager (PM) */
  SCIF_IRQn                = 23, /**< 23 SAM4LC2A System Control Interface (SCIF) */
  FREQM_IRQn               = 24, /**< 24 SAM4LC2A Frequency Meter (FREQM) */
  GPIO_0_IRQn              = 25, /**< 25 SAM4LC2A General-Purpose Input/Output Controller (GPIO) */
  GPIO_1_IRQn              = 26, /**< 26 SAM4LC2A General-Purpose Input/Output Controller (GPIO) */
  GPIO_2_IRQn              = 27, /**< 27 SAM4LC2A General-Purpose Input/Output Controller (GPIO) */
  GPIO_3_IRQn              = 28, /**< 28 SAM4LC2A General-Purpose Input/Output Controller (GPIO) */
  GPIO_4_IRQn              = 29, /**< 29 SAM4LC2A General-Purpose Input/Output Controller (GPIO) */
  GPIO_5_IRQn              = 30, /**< 30 SAM4LC2A General-Purpose Input/Output Controller (GPIO) */
  GPIO_6_IRQn              = 31, /**< 31 SAM4LC2A General-Purpose Input/Output Controller (GPIO) */
  GPIO_7_IRQn              = 32, /**< 32 SAM4LC2A General-Purpose Input/Output Controller (GPIO) */
  GPIO_8_IRQn              = 33, /**< 33 SAM4LC2A General-Purpose Input/Output Controller (GPIO) */
  GPIO_9_IRQn              = 34, /**< 34 SAM4LC2A General-Purpose Input/Output Controller (GPIO) */
  GPIO_10_IRQn             = 35, /**< 35 SAM4LC2A General-Purpose Input/Output Controller (GPIO) */
  GPIO_11_IRQn             = 36, /**< 36 SAM4LC2A General-Purpose Input/Output Controller (GPIO) */
  BPM_IRQn                 = 37, /**< 37 SAM4LC2A Backup Power Manager (BPM) */
  BSCIF_IRQn               = 38, /**< 38 SAM4LC2A Backup System Control Interface (BSCIF) */
  AST_ALARM_IRQn           = 39, /**< 39 SAM4LC2A Asynchronous Timer (AST) */
  AST_PER_IRQn             = 40, /**< 40 SAM4LC2A Asynchronous Timer (AST) */
  AST_OVF_IRQn             = 41, /**< 41 SAM4LC2A Asynchronous Timer (AST) */
  AST_READY_IRQn           = 42, /**< 42 SAM4LC2A Asynchronous Timer (AST) */
  AST_CLKREADY_IRQn        = 43, /**< 43 SAM4LC2A Asynchronous Timer (AST) */
  WDT_IRQn                 = 44, /**< 44 SAM4LC2A Watchdog Timer (WDT) */
  EIC_1_IRQn               = 45, /**< 45 SAM4LC2A External Interrupt Controller (EIC) */
  EIC_2_IRQn               = 46, /**< 46 SAM4LC2A External Interrupt Controller (EIC) */
  EIC_3_IRQn               = 47, /**< 47 SAM4LC2A External Interrupt Controller (EIC) */
  EIC_4_IRQn               = 48, /**< 48 SAM4LC2A External Interrupt Controller (EIC) */
  EIC_5_IRQn               = 49, /**< 49 SAM4LC2A External Interrupt Controller (EIC) */
  EIC_6_IRQn               = 50, /**< 50 SAM4LC2A External Interrupt Controller (EIC) */
  EIC_7_IRQn               = 51, /**< 51 SAM4LC2A External Interrupt Controller (EIC) */
  EIC_8_IRQn               = 52, /**< 52 SAM4LC2A External Interrupt Controller (EIC) */
  IISC_IRQn                = 53, /**< 53 SAM4LC2A Inter-IC Sound (I2S) Controller (IISC) */
  SPI_IRQn                 = 54, /**< 54 SAM4LC2A Serial Peripheral Interface (SPI) */
  TC00_IRQn                = 55, /**< 55 SAM4LC2A Timer/Counter 0 (TC0) */
  TC01_IRQn                = 56, /**< 56 SAM4LC2A Timer/Counter 0 (TC0) */
  TC02_IRQn                = 57, /**< 57 SAM4LC2A Timer/Counter 0 (TC0) */
  TC10_IRQn                = 58, /**< 58 SAM4LC2A Timer/Counter 1 (TC1) */
  TC11_IRQn                = 59, /**< 59 SAM4LC2A Timer/Counter 1 (TC1) */
  TC12_IRQn                = 60, /**< 60 SAM4LC2A Timer/Counter 1 (TC1) */
  TWIM0_IRQn               = 61, /**< 61 SAM4LC2A Two-wire Master Interface 0 (TWIM0) */
  TWIS0_IRQn               = 62, /**< 62 SAM4LC2A Two-wire Slave Interface 0 (TWIS0) */
  TWIM1_IRQn               = 63, /**< 63 SAM4LC2A Two-wire Master Interface 1 (TWIM1) */
  TWIS1_IRQn               = 64, /**< 64 SAM4LC2A Two-wire Slave Interface 1 (TWIS1) */
  USART0_IRQn              = 65, /**< 65 SAM4LC2A Universal Synchronous Asynchronous Receiver Transmitter 0 (USART0) */
  USART1_IRQn              = 66, /**< 66 SAM4LC2A Universal Synchronous Asynchronous Receiver Transmitter 1 (USART1) */
  USART2_IRQn              = 67, /**< 67 SAM4LC2A Universal Synchronous Asynchronous Receiver Transmitter 2 (USART2) */
  USART3_IRQn              = 68, /**< 68 SAM4LC2A Universal Synchronous Asynchronous Receiver Transmitter 3 (USART3) */
  ADCIFE_IRQn              = 69, /**< 69 SAM4LC2A ADC controller interface (ADCIFE) */
  DACC_IRQn                = 70, /**< 70 SAM4LC2A DAC Controller (DACC) */
  ACIFC_IRQn               = 71, /**< 71 SAM4LC2A Analog Comparator Interface (ACIFC) */
  ABDACB_IRQn              = 72, /**< 72 SAM4LC2A Audio Bitstream DAC (ABDACB) */
  TRNG_IRQn                = 73, /**< 73 SAM4LC2A True Random Number Generator (TRNG) */
  PARC_IRQn                = 74, /**< 74 SAM4LC2A Parallel Capture (PARC) */
  CATB_IRQn                = 75, /**< 75 SAM4LC2A Capacitive Touch Module B (CATB) */
  TWIM2_IRQn               = 77, /**< 77 SAM4LC2A Two-wire Master Interface 2 (TWIM2) */
  TWIM3_IRQn               = 78, /**< 78 SAM4LC2A Two-wire Master Interface 3 (TWIM3) */
#if defined(SAM4LCXA) || defined(SAM4LCXB) || defined(SAM4LCXC)
  LCDCA_IRQn               = 79, /**< 79 SAM4LC2A LCD Controller (LCDCA) */
#endif
  PERIPH_COUNT_IRQn        = 80  /**< Number of peripheral IDs */
} IRQn_Type;

/* Cortex-M4 processor handlers */
void NMI_Handler                 ( void );
void HardFault_Handler           ( void );
void MemManage_Handler           ( void );
void BusFault_Handler            ( void );
void UsageFault_Handler          ( void );
void SVC_Handler                 ( void );
void DebugMon_Handler            ( void );
void PendSV_Handler              ( void );
void SysTick_Handler             ( void );

/* Peripherals handlers */
void HFLASHC_Handler             ( void );
void PDCA_0_Handler              ( void );
void PDCA_1_Handler              ( void );
void PDCA_2_Handler              ( void );
void PDCA_3_Handler              ( void );
void PDCA_4_Handler              ( void );
void PDCA_5_Handler              ( void );
void PDCA_6_Handler              ( void );
void PDCA_7_Handler              ( void );
void PDCA_8_Handler              ( void );
void PDCA_9_Handler              ( void );
void PDCA_10_Handler             ( void );
void PDCA_11_Handler             ( void );
void PDCA_12_Handler             ( void );
void PDCA_13_Handler             ( void );
void PDCA_14_Handler             ( void );
void PDCA_15_Handler             ( void );
void CRCCU_Handler               ( void );
void USBC_Handler                ( void );
void PEVC_TR_Handler             ( void );
void PEVC_OV_Handler             ( void );
#if defined(SAM4LCXA) || defined(SAM4LCXB) || defined(SAM4LCXC)
void AESA_Handler                ( void );
#endif
void PM_Handler                  ( void );
void SCIF_Handler                ( void );
void FREQM_Handler               ( void );
void GPIO_0_Handler              ( void );
void GPIO_1_Handler              ( void );
void GPIO_2_Handler              ( void );
void GPIO_3_Handler              ( void );
void GPIO_4_Handler              ( void );
void GPIO_5_Handler              ( void );
void GPIO_6_Handler              ( void );
void GPIO_7_Handler              ( void );
void GPIO_8_Handler              ( void );
void GPIO_9_Handler              ( void );
void GPIO_10_Handler             ( void );
void GPIO_11_Handler             ( void );
void BPM_Handler                 ( void );
void BSCIF_Handler               ( void );
void AST_ALARM_Handler           ( void );
void AST_PER_Handler             ( void );
void AST_OVF_Handler             ( void );
void AST_READY_Handler           ( void );
void AST_CLKREADY_Handler        ( void );
void WDT_Handler                 ( void );
void EIC_1_Handler               ( void );
void EIC_2_Handler               ( void );
void EIC_3_Handler               ( void );
void EIC_4_Handler               ( void );
void EIC_5_Handler               ( void );
void EIC_6_Handler               ( void );
void EIC_7_Handler               ( void );
void EIC_8_Handler               ( void );
void IISC_Handler                ( void );
void SPI_Handler                 ( void );
void TC00_Handler                ( void );
void TC01_Handler                ( void );
void TC02_Handler                ( void );
void TC10_Handler                ( void );
void TC11_Handler                ( void );
void TC12_Handler                ( void );
void TWIM0_Handler               ( void );
void TWIS0_Handler               ( void );
void TWIM1_Handler               ( void );
void TWIS1_Handler               ( void );
void USART0_Handler              ( void );
void USART1_Handler              ( void );
void USART2_Handler              ( void );
void USART3_Handler              ( void );
void ADCIFE_Handler              ( void );
void DACC_Handler                ( void );
void ACIFC_Handler               ( void );
void ABDACB_Handler              ( void );
void TRNG_Handler                ( void );
void PARC_Handler                ( void );
void CATB_Handler                ( void );
void TWIM2_Handler               ( void );
void TWIM3_Handler               ( void );
#if defined(SAM4LCXA) || defined(SAM4LCXB) || defined(SAM4LCXC)
void LCDCA_Handler               ( void );
#endif

#define __BB_PRESENT           0         /*!< BIT_BANDING present or not */
#define __CLKGATE_PRESENT      1         /*!< CLKGATE present or not */
#define __CM4_REV              1         /*!< Core revision r0p1 */
#define __DEBUG_LVL            3         /*!< Full debug plus DWT data matching */
#define __FPU_PRESENT          0         /*!< FPU present or not */
#define __JTAG_PRESENT         1         /*!< JTAG present or not */
#define __MPU_PRESENT          1         /*!< MPU present or not */
#define __NVIC_PRIO_BITS       4         /*!< Number of bits used for Priority Levels */
#define __TRACE_LVL            1         /*!< Standard trace: ITM and DWT triggers and counters, but no ETM */
#define __Vendor_SysTickConfig 0         /*!< Set to 1 if different SysTick Config is used */
#define __WIC_PRESENT          0         /*!< WIC present or not */

#include <core_cm4.h>
#include "system_sam4l.h"

/* ************************************************************************** */
/**  SOFTWARE PERIPHERAL API DEFINITION FOR SAM4LC2A */
/* ************************************************************************** */
/** \addtogroup SAM4LC2A_api Peripheral Software API */
/*@{*/

