IOsonata/IOsonata/ARM/Microchip/SAM4L/include/sam4lxxx.h
#include "component/component_abdacb.h"
#include "component/component_acifc.h"
#include "component/component_adcife.h"
#include "component/component_aesa.h"
#include "component/component_ast.h"
#include "component/component_bpm.h"
#include "component/component_bscif.h"
#include "component/component_catb.h"
#include "component/component_chipid.h"
#include "component/component_crccu.h"
#include "component/component_dacc.h"
#include "component/component_eic.h"
#include "component/component_flashcalw.h"
#include "component/component_freqm.h"
#include "component/component_gloc.h"
#include "component/component_gpio.h"
#include "component/component_hcache.h"
#include "component/component_hmatrixb.h"
#include "component/component_iisc.h"
#include "component/component_lcdca.h"
#include "component/component_parc.h"
#include "component/component_pdca.h"
#include "component/component_pevc.h"
#include "component/component_picouart.h"
#include "component/component_pm.h"
#include "component/component_scif.h"
#include "component/component_smap.h"
#include "component/component_spi.h"
#include "component/component_tc.h"
#include "component/component_trng.h"
#include "component/component_twim.h"
#include "component/component_twis.h"
#include "component/component_usart.h"
#include "component/component_usbc.h"
#include "component/component_wdt.h"
/*@}*/

/* ************************************************************************** */
/**  REGISTERS ACCESS DEFINITIONS FOR SAM4LC2A */
/* ************************************************************************** */
/** \addtogroup SAM4LC2A_reg Registers Access Definitions */
/*@{*/

#include "instance/instance_abdacb.h"
#include "instance/instance_acifc.h"
#include "instance/instance_adcife.h"
#include "instance/instance_aesa.h"
#include "instance/instance_ast.h"
#include "instance/instance_bpm.h"
#include "instance/instance_bscif.h"
#include "instance/instance_catb.h"
#include "instance/instance_chipid.h"
#include "instance/instance_crccu.h"
#include "instance/instance_dacc.h"
#include "instance/instance_eic.h"
#include "instance/instance_hflashc.h"
#include "instance/instance_freqm.h"
#include "instance/instance_gloc.h"
#include "instance/instance_gpio.h"
#include "instance/instance_hcache.h"
#include "instance/instance_hmatrix.h"
#include "instance/instance_iisc.h"
#include "instance/instance_lcdca.h"
#include "instance/instance_parc.h"
#include "instance/instance_pdca.h"
#include "instance/instance_pevc.h"
#include "instance/instance_picouart.h"
#include "instance/instance_pm.h"
#include "instance/instance_scif.h"
#include "instance/instance_smap.h"
#include "instance/instance_spi.h"
#include "instance/instance_tc0.h"
#include "instance/instance_tc1.h"
#include "instance/instance_trng.h"
#include "instance/instance_twim0.h"
#include "instance/instance_twim1.h"
#include "instance/instance_twim2.h"
#include "instance/instance_twim3.h"
#include "instance/instance_twis0.h"
#include "instance/instance_twis1.h"
#include "instance/instance_usart0.h"
#include "instance/instance_usart1.h"
#include "instance/instance_usart2.h"
#include "instance/instance_usart3.h"
#include "instance/instance_usbc.h"
#include "instance/instance_wdt.h"
/*@}*/

// Peripheral instances on HTOP0 bridge
#define ID_IISC           0 /**< \brief Inter-IC Sound (I2S) Controller (IISC) */
#define ID_SPI            1 /**< \brief Serial Peripheral Interface (SPI) */
#define ID_TC0            2 /**< \brief Timer/Counter TC (TC0) */
#define ID_TC1            3 /**< \brief Timer/Counter TC (TC1) */
#define ID_TWIM0          4 /**< \brief Two-wire Master Interface TWIM (TWIM0) */
#define ID_TWIS0          5 /**< \brief Two-wire Slave Interface TWIS (TWIS0) */
#define ID_TWIM1          6 /**< \brief Two-wire Master Interface TWIM (TWIM1) */
#define ID_TWIS1          7 /**< \brief Two-wire Slave Interface TWIS (TWIS1) */
#define ID_USART0         8 /**< \brief Universal Synchronous Asynchronous Receiver Transmitter USART (USART0) */
#define ID_USART1         9 /**< \brief Universal Synchronous Asynchronous Receiver Transmitter USART (USART1) */
#define ID_USART2        10 /**< \brief Universal Synchronous Asynchronous Receiver Transmitter USART (USART2) */
#define ID_USART3        11 /**< \brief Universal Synchronous Asynchronous Receiver Transmitter USART (USART3) */
#define ID_ADCIFE        12 /**< \brief ADC controller interface (ADCIFE) */
#define ID_DACC          13 /**< \brief DAC Controller (DACC) */
#define ID_ACIFC         14 /**< \brief Analog Comparator Interface (ACIFC) */
#define ID_GLOC          15 /**< \brief Glue Logic Controller (GLOC) */
#define ID_ABDACB        16 /**< \brief Audio Bitstream DAC (ABDACB) */
#define ID_TRNG          17 /**< \brief True Random Number Generator (TRNG) */
#define ID_PARC          18 /**< \brief Parallel Capture (PARC) */
#define ID_CATB          19 /**< \brief Capacitive Touch Module B (CATB) */
#define ID_TWIM2         20 /**< \brief Two-wire Master Interface TWIM (TWIM2) */
#define ID_TWIM3         21 /**< \brief Two-wire Master Interface TWIM (TWIM3) */
#if defined(SAM4LCXA) || defined(SAM4LCXB) || defined(SAM4LCXC)
#define ID_LCDCA         22 /**< \brief LCD Controller (LCDCA) */
#endif

// Peripheral instances on HTOP1 bridge
#define ID_HFLASHC       32 /**< \brief Flash Controller (HFLASHC) */
#define ID_HCACHE        33 /**< \brief Cortex M I&D Cache Controller (HCACHE) */
#define ID_HMATRIX       34 /**< \brief HSB Matrix (HMATRIX) */
#define ID_PDCA          35 /**< \brief Peripheral DMA Controller (PDCA) */
#define ID_SMAP          36 /**< \brief System Manager Access Port (SMAP) */
#define ID_CRCCU         37 /**< \brief CRC Calculation Unit (CRCCU) */
#define ID_USBC          38 /**< \brief USB 2.0 Interface (USBC) */
#define ID_PEVC          39 /**< \brief Peripheral Event Controller (PEVC) */

// Peripheral instances on HTOP2 bridge
#define ID_PM            64 /**< \brief Power Manager (PM) */
#define ID_CHIPID        65 /**< \brief Chip ID Registers (CHIPID) */
#define ID_SCIF          66 /**< \brief System Control Interface (SCIF) */
#define ID_FREQM         67 /**< \brief Frequency Meter (FREQM) */
#define ID_GPIO          68 /**< \brief General-Purpose Input/Output Controller (GPIO) */

// Peripheral instances on HTOP3 bridge
#define ID_BPM           96 /**< \brief Backup Power Manager (BPM) */
#define ID_BSCIF         97 /**< \brief Backup System Control Interface (BSCIF) */
#define ID_AST           98 /**< \brief Asynchronous Timer (AST) */
#define ID_WDT           99 /**< \brief Watchdog Timer (WDT) */
#define ID_EIC          100 /**< \brief External Interrupt Controller (EIC) */
#define ID_PICOUART     101 /**< \brief Pico UART (PICOUART) */

#define ID_PERIPH_COUNT 102 /**< \brief Number of peripheral IDs */

#define SAM4L_ABDACB            ((Abdacb   *)0x40064000U) /**< \brief (ABDACB) APB Base Address */
#define SAM4L_ABDACB_ADDR                   (0x40064000U) /**< \brief (ABDACB) APB Base Address */
#define SAM4L_ABDACB_INST_NUM   1                         /**< \brief (ABDACB) Number of instances */
#define SAM4L_ABDACB_INSTS      { SAM4L_ABDACB }                /**< \brief (ABDACB) Instances List */

#define SAM4L_ACIFC             ((Acifc    *)0x40040000U) /**< \brief (ACIFC) APB Base Address */
#define SAM4L_ACIFC_ADDR                    (0x40040000U) /**< \brief (ACIFC) APB Base Address */
#define SAM4L_ACIFC_INST_NUM    1                         /**< \brief (ACIFC) Number of instances */
#define SAM4L_ACIFC_INSTS       { SAM4L_ACIFC }                 /**< \brief (ACIFC) Instances List */

#define SAM4L_ADCIFE            ((Adcife   *)0x40038000U) /**< \brief (ADCIFE) APB Base Address */
#define SAM4L_ADCIFE_ADDR                   (0x40038000U) /**< \brief (ADCIFE) APB Base Address */
#define SAM4L_ADCIFE_INST_NUM   1                         /**< \brief (ADCIFE) Number of instances */
#define SAM4L_ADCIFE_INSTS      { SAM4L_ADCIFE }                /**< \brief (ADCIFE) Instances List */

#if defined(SAM4LCXA) || defined(SAM4LCXB) || defined(SAM4LCXC)

#define SAM4L_AESA              ((Aesa     *)0x400B0000U) /**< \brief (AESA) AHB Base Address */
#define SAM4L_AESA_ADDR                     (0x400B0000U) /**< \brief (AESA) AHB Base Address */
#define SAM4L_AESA_INST_NUM     1                         /**< \brief (AESA) Number of instances */
#define SAM4L_AESA_INSTS        { SAM4L_AESA }                  /**< \brief (AESA) Instances List */

#endif

#define SAM4L_AST               ((Ast      *)0x400F0800U) /**< \brief (AST) APB Base Address */
#define SAM4L_AST_ADDR                      (0x400F0800U) /**< \brief (AST) APB Base Address */
#define SAM4L_AST_INST_NUM      1                         /**< \brief (AST) Number of instances */
#define SAM4L_AST_INSTS         { SAM4L_AST }                   /**< \brief (AST) Instances List */

#define SAM4L_BPM               ((Bpm      *)0x400F0000U) /**< \brief (BPM) APB Base Address */
#define SAM4L_BPM_ADDR                      (0x400F0000U) /**< \brief (BPM) APB Base Address */
#define SAM4L_BPM_INST_NUM      1                         /**< \brief (BPM) Number of instances */
#define SAM4L_BPM_INSTS         { SAM4L_BPM }                   /**< \brief (BPM) Instances List */

#define SAM4L_BSCIF             ((Bscif    *)0x400F0400U) /**< \brief (BSCIF) APB Base Address */
#define SAM4L_BSCIF_ADDR                    (0x400F0400U) /**< \brief (BSCIF) APB Base Address */
#define SAM4L_BSCIF_INST_NUM    1                         /**< \brief (BSCIF) Number of instances */
#define SAM4L_BSCIF_INSTS       { SAM4L_BSCIF }                 /**< \brief (BSCIF) Instances List */

#define SAM4L_CATB              ((Catb     *)0x40070000U) /**< \brief (CATB) APB Base Address */
#define SAM4L_CATB_ADDR                     (0x40070000U) /**< \brief (CATB) APB Base Address */
#define SAM4L_CATB_INST_NUM     1                         /**< \brief (CATB) Number of instances */
#define SAM4L_CATB_INSTS        { SAM4L_CATB }                  /**< \brief (CATB) Instances List */

#define SAM4L_CHIPID            ((Chipid   *)0x400E0400U) /**< \brief (CHIPID) APB Base Address */
#define SAM4L_CHIPID_ADDR                   (0x400E0400U) /**< \brief (CHIPID) APB Base Address */
#define SAM4L_CHIPID_INST_NUM   1                         /**< \brief (CHIPID) Number of instances */
#define SAM4L_CHIPID_INSTS      { SAM4L_CHIPID }                /**< \brief (CHIPID) Instances List */

#define SAM4L_CRCCU             ((Crccu    *)0x400A4000U) /**< \brief (CRCCU) APB Base Address */
#define SAM4L_CRCCU_ADDR                    (0x400A4000U) /**< \brief (CRCCU) APB Base Address */
#define SAM4L_CRCCU_INST_NUM    1                         /**< \brief (CRCCU) Number of instances */
#define SAM4L_CRCCU_INSTS       { SAM4L_CRCCU }                 /**< \brief (CRCCU) Instances List */

#define SAM4L_DACC              ((Dacc     *)0x4003C000U) /**< \brief (DACC) APB Base Address */
#define SAM4L_DACC_ADDR                     (0x4003C000U) /**< \brief (DACC) APB Base Address */
#define SAM4L_DACC_INST_NUM     1                         /**< \brief (DACC) Number of instances */
#define SAM4L_DACC_INSTS        { SAM4L_DACC }                  /**< \brief (DACC) Instances List */

#define SAM4L_EIC               ((Eic      *)0x400F1000U) /**< \brief (EIC) APB Base Address */
#define SAM4L_EIC_ADDR                      (0x400F1000U) /**< \brief (EIC) APB Base Address */
#define SAM4L_EIC_INST_NUM      1                         /**< \brief (EIC) Number of instances */
#define SAM4L_EIC_INSTS         { SAM4L_EIC }                   /**< \brief (EIC) Instances List */

#define SAM4L_HFLASHC           ((Flashcalw *)0x400A0000U) /**< \brief (HFLASHC) APB Base Address */
#define SAM4L_HFLASHC_ADDR                  (0x400A0000U) /**< \brief (HFLASHC) APB Base Address */
#define SAM4L_HFLASHC_FROW      ((Flashcalw *)0x00800200U) /**< \brief (HFLASHC) FROW Base Address */
#define SAM4L_HFLASHC_FROW_ADDR             (0x00800200U) /**< \brief (HFLASHC) FROW Base Address */
#define SAM4L_HFLASHC_USER      ((Flashcalw *)0x00800000U) /**< \brief (HFLASHC) USER Base Address */
#define SAM4L_HFLASHC_USER_ADDR             (0x00800000U) /**< \brief (HFLASHC) USER Base Address */
#define SAM4L_FLASHCALW_INST_NUM 1                         /**< \brief (FLASHCALW) Number of instances */
#define SAM4L_FLASHCALW_INSTS   { SAM4L_HFLASHC }               /**< \brief (FLASHCALW) Instances List */

#define SAM4L_FREQM             ((Freqm    *)0x400E0C00U) /**< \brief (FREQM) APB Base Address */
#define SAM4L_FREQM_ADDR                    (0x400E0C00U) /**< \brief (FREQM) APB Base Address */
#define SAM4L_FREQM_INST_NUM    1                         /**< \brief (FREQM) Number of instances */
#define SAM4L_FREQM_INSTS       { SAM4L_FREQM }                 /**< \brief (FREQM) Instances List */

#define SAM4L_GLOC              ((Gloc     *)0x40060000U) /**< \brief (GLOC) APB Base Address */
#define SAM4L_GLOC_ADDR                     (0x40060000U) /**< \brief (GLOC) APB Base Address */
#define SAM4L_GLOC_INST_NUM     1                         /**< \brief (GLOC) Number of instances */
#define SAM4L_GLOC_INSTS        { SAM4L_GLOC }                  /**< \brief (GLOC) Instances List */

