IOsonata/IOsonata/ARM/Microchip/SAM4L/include/sam4lxxx.h
#define SAM4L_WDT               ((Wdt      *)0x400F0C00U) /**< \brief (WDT) APB Base Address */
#define SAM4L_WDT_ADDR                      (0x400F0C00U) /**< \brief (WDT) APB Base Address */
#define SAM4L_WDT_INST_NUM      1                         /**< \brief (WDT) Number of instances */
#define SAM4L_WDT_INSTS         { SAM4L_WDT }                   /**< \brief (WDT) Instances List */


#if defined(SAM4LCXA)
#include "pio/pio_sam4lcxa.h"
#elif defined(SAM4LCXB)
#include "pio/pio_sam4lcxb.h"
#elif defined(SAM4LCXC)
#include "pio/pio_sam4lcxc.h"
#elif defined(SAM4LSXA)
#include "pio/pio_sam4lsxa.h"
#elif defined(SAM4LSXB)
#include "pio/pio_sam4lsxb.h"
#elif defined(SAM4LSXC)
#include "pio/pio_sam4lsxc.h"
#endif

/* ************************************************************************** */
/**  ADDITIONAL DEFINITIONS FOR COMPATIBILITY */
/* ************************************************************************** */
/** \addtogroup SAM4LC2A_compat Definitions */
/*@{*/
// These defines are used to keep compatibility with existing
// sam/drivers/usart implementation from SAM3/4 products with SAM4L product.
#define US_MR_USART_MODE_HW_HANDSHAKING  US_MR_USART_MODE_HARDWARE
#define US_MR_USART_MODE_IS07816_T_0     US_MR_USART_MODE_ISO7816_T0
#define US_MR_USART_MODE_IS07816_T_1     US_MR_USART_MODE_ISO7816_T1
#define US_MR_NBSTOP_2_BIT    US_MR_NBSTOP_2
#define US_MR_NBSTOP_1_5_BIT  US_MR_NBSTOP_1_5
#define US_MR_NBSTOP_1_BIT    US_MR_NBSTOP_1
#define US_MR_CHRL_8_BIT      US_MR_CHRL_8
#define US_MR_PAR_NO          US_MR_PAR_NONE
#define US_MR_PAR_MULTIDROP   US_MR_PAR_MULTI
#define US_IF                 US_IFR
#define US_WPSR_WPVS          US_WPSR_WPV_1

#define USBC_UPCFG0_PBK_Msk   (0x1u << USBC_UPCFG0_PBK_Pos)

// These defines for homogeneity with other SAM header files.
#define CHIP_FREQ_FWS_0       (18000000UL) /**< \brief Maximum operating frequency when FWS is 0 */
#define CHIP_FREQ_FWS_1       (36000000UL) /**< \brief Maximum operating frequency when FWS is 1 */
// WARNING NOTE: these are preliminary values.
#define CHIP_FREQ_FLASH_HSEN_FWS_0 (18000000UL) /**< \brief Maximum operating frequency when FWS is 0 and the FLASH HS mode is enabled */
#define CHIP_FREQ_FLASH_HSEN_FWS_1 (36000000UL) /**< \brief Maximum operating frequency when FWS is 1 and the FLASH HS mode is enabled */

// These defines are used to keep compatibility with existing
// sam/drivers/tc implementation from SAM3/4 products with SAM4L product.
#define TC_CMR_LDRA_RISING    TC_CMR_LDRA_POS_EDGE_TIOA
#define TC_CMR_LDRB_FALLING   TC_CMR_LDRB_NEG_EDGE_TIOA
#define TC_CMR_ETRGEDG_FALLING TC_CMR_ETRGEDG_NEG_EDGE

// These defines are used to keep compatibility with existing
// sam/drivers/spi implementation from SAM3/4 products with SAM4L product.
#define SPI_CSR_BITS_8_BIT    SPI_CSR_BITS_8_BPT
#define SPI_WPCR_SPIWPKEY_VALUE SPI_WPCR_WPKEY_VALUE
#define SPI_WPCR_SPIWPEN      SPI_WPCR_WPEN

// These defines are used to keep compatibility with existing
// sam/drivers/crccu implementation from SAM3/4 products with SAM4L product.
#define CRCCU_DMA_EN          CRCCU_DMAEN
#define CRCCU_DMA_DIS         CRCCU_DMADIS
#define CRCCU_DMA_SR          CRCCU_DMASR
#define CRCCU_DMA_IER         CRCCU_DMAIER
#define CRCCU_DMA_IDR         CRCCU_DMAIDR
#define CRCCU_DMA_IMR         CRCCU_DMAIMR
#define CRCCU_DMA_ISR         CRCCU_DMAISR
#define CRCCU_DMA_EN_DMAEN    CRCCU_DMAEN_DMAEN
#define CRCCU_DMA_DIS_DMADIS  CRCCU_DMADIS_DMADIS
#define CRCCU_DMA_SR_DMASR    CRCCU_DMASR_DMASR
#define CRCCU_DMA_IER_DMAIER  CRCCU_DMAIER_DMAIER
#define CRCCU_DMA_IDR_DMAIDR  CRCCU_DMAIDR_DMAIDR
#define CRCCU_DMA_IMR_DMAIMR  CRCCU_DMAIMR_DMAIMR
#define CRCCU_DMA_ISR_DMAISR  CRCCU_DMAISR_DMAISR
/*@}*/

/* **************************************************************************/
/**  MEMORY MAPPING DEFINITIONS 											*/
/* **************************************************************************/
#if defined(__SAM4LC2A__) || defined(__SAM4LC2B__) || defined(__SAM4LC2C__) || defined(__ATSAM4LC2A__) || defined(__ATSAM4LC2B__) || defined(__ATSAM4LC2C__) || \
	defined(__SAM4LS2A__) || defined(__SAM4LS2B__) || defined(__SAM4LS2C__) || defined(__ATSAM4LS2A__) || defined(__ATSAM4LS2B__) || defined(__ATSAM4LS2C__)

#define FLASH_SIZE            0x20000 /* 128 kB */
#define FLASH_PAGE_SIZE       512
#define FLASH_NB_OF_PAGES     256
#define FLASH_USER_PAGE_SIZE  512
#define HRAMC0_SIZE           0x8000 /* 32 kB */
#define HRAMC1_SIZE           0x800 /* 2 kB */
#define FLASH_ADDR            (0x00000000U) /**< FLASH base address */
#define FLASH_USER_PAGE_ADDR  (0x00800000U) /**< FLASH_USER_PAGE base address */
#define HRAMC0_ADDR           (0x20000000U) /**< HRAMC0 base address */
#define HRAMC1_ADDR           (0x21000000U) /**< HRAMC1 base address */

#elif defined(__SAM4LC4A__) || defined(__SAM4LC4B__) || defined(__SAM4LC4C__) || defined(__ATSAM4LC4A__) || defined(__ATSAM4LC4B__) || defined(__ATSAM4LC4C__) || \
	  defined(__SAM4LS4A__) || defined(__SAM4LS4B__) || defined(__SAM4LS4C__) || defined(__ATSAM4LS4A__) || defined(__ATSAM4LS4B__) || defined(__ATSAM4LS4C__)

#define FLASH_SIZE            0x40000 /* 256 kB */
#define FLASH_PAGE_SIZE       512
#define FLASH_NB_OF_PAGES     512
#define FLASH_USER_PAGE_SIZE  512
#define HRAMC0_SIZE           0x8000 /* 32 kB */
#define HRAMC1_SIZE           0x800 /* 2 kB */
#define FLASH_ADDR            (0x00000000U) /**< FLASH base address */
#define FLASH_USER_PAGE_ADDR  (0x00800000U) /**< FLASH_USER_PAGE base address */
#define HRAMC0_ADDR           (0x20000000U) /**< HRAMC0 base address */
#define HRAMC1_ADDR           (0x21000000U) /**< HRAMC1 base address */

#elif defined(__SAM4LC8A__) || defined(__SAM4LC8B__) || defined(__SAM4LC8C__) || defined(__ATSAM4LC8A__) || defined(__ATSAM4LC8B__) || defined(__ATSAM4LC8C__) || \
	  defined(__SAM4LS8A__) || defined(__SAM4LS8B__) || defined(__SAM4LS8C__) || defined(__ATSAM4LS8A__) || defined(__ATSAM4LS8B__) || defined(__ATSAM4LS8C__)

#define FLASH_SIZE            0x80000 /* 512 kB */
#define FLASH_PAGE_SIZE       512
#define FLASH_NB_OF_PAGES     1024
#define FLASH_USER_PAGE_SIZE  512
#define HRAMC0_SIZE           0x10000 /* 64 kB */
#define HRAMC1_SIZE           0x800 /* 2 kB */
#define FLASH_ADDR            (0x00000000U) /**< FLASH base address */
#define FLASH_USER_PAGE_ADDR  (0x00800000U) /**< FLASH_USER_PAGE base address */
#define HRAMC0_ADDR           (0x20000000U) /**< HRAMC0 base address */
#define HRAMC1_ADDR           (0x21000000U) /**< HRAMC1 base address */
#endif

#endif // __SAM4LXXX_H__
